// -------select Elements
let $=document;
let productDetailContainer=$.querySelector('.product-info');

// -------My data
let productData=[
    {id:1 ,name:"گیاه فیکوس لیراتا",price:1_500_000,image:'./assest/images/1.jpg' ,detail:"این درخت زینتی مخصوص مناطق نیمه گرمسیری و گرمسیری است و می‌توان آن را در گلدان نیز نگهداری کرد.ولی در صورت کاشت در زمین از رشد به مراتب سریع‌تری برخوردار می‌باشد.برگ‌های فیکوس لیراتا علاوه بر تصفیه کردن و کاهش گرد و غبار هوا، رطوبت محیط را هم کنترل می‌کند.همین موضوع باعث شده تا این گیاه باعث کاهش ابتلا به بیماری‌هایی مثل سرماخوردگی، گلودرد و عطسه شود.این گیاه تا حدودی سمی است و خورده شدن برگ‌های این گیاه ( فرقی نمی‌کند توسط سگ، گربه و یا کودک ) می‌تواند باعث بروز عوارض شود."},
    {id:2 ,name:"گیاه باباآدم",price:1_760_000,image:'./assest/images/2.jpg' ,detail:"گل بابا آدم گیاهی استوایی ست با برگ‌های خشن، بزرگ و افتاده. این گیاه با کاشت پیاز و غده های ریشه دار در خاک رشد می‌کند. برگ‌های غول پیکر بابا آدم ظاهری جذاب و زیبا دارند. دمبرگ ها و ساقه های این گیاه تا 60 الی 90 سانتی متر رشد می‌کنند. همچنین معمولاً ارتفاع گل بابا آدم غول پیکر به 90 تا 150 سانتی متر در داخل خانه می‌رسد اما در خارج از خانه در شرایط محیطی مناسب تا 5 متر نیز رشد می‌کند.برگ‌های بابا آدم بزرگ و عریض بوده و تیرکمانی شکل هستند. هر قدر گیاه از نور بیشتری برخوردار شود، برگ‌های آن پهن تر و مقاوم تر خواهد بود. بر روی برگ‌های بابا آدم، لکه هایی به رنگ سفید و قرمز دیده می‌شود. 15 گونه مختلف از بابا آدم وجود دارد که عموماً چندساله هستند."},
    {id:3 ,name:"گیاه یوکا",price:3_500_000,image:'./assest/images/3.jpg' ,detail:"درختچه یوکا یکی از زیباترین و متفاوت ترین گیاهان آپارتمانی است. نگهداری یوکا هم در آپارتمان و هم در باغچه حیاط منزلتان امکان پذیر است. گیاه یوکا دارای برگ هایی بزرگ و کشیده و خنجری شکل می باشد که با حذف جوانه های انتهایی به گیاه دو الی سه شاخه اضافه خواهد شد. یوکا در سال یک مرتبه گل خواهد داد و گل های سفید و کرمی آن به شکل زنگوله ای کوچک و واژگون پدیدار خواهند شد و توجه داشته باشید که این گیاه در محیط های آپارتمانی گل نخواهد داد. "}
];

// -------find product object 
let productID=new URLSearchParams(location.search).get('id');
let productObj=productData.find(product=>{
    return product.id==productID
});

// -------insert data in product.html
productDetailContainer.insertAdjacentHTML('afterbegin',`<div class="product-info__note">
<h2 class="product-info__title">${productObj.name} </h2>
<p class="product-info__detail">${productObj.detail}</p>
</div>
<div class="product-info__image">
<img src=${productObj.image} >
</div>`);

